Sail2D/Runs/first_multiarc_300_20/case/system/baffleDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      createBafflesDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

internalFacesOnly true;

baffles
{
    baffleFaces
    {
        type		faceZone;
        zoneName	wings;
	   flip		false;
	
        patches
        {
            master
            {
                name            wings;
                type            wall;
                patchFields
                {
                    nut
                    {
                        type            nutUSpaldingWallFunction;
                        value           uniform 0;
                    }
                    nuTilda
                    {
                        type            fixedValue;
                        value           uniform 0;
                    }
                    p
                    {
                        type            zeroGradient;
                    }
                    U
                    {
                        type            fixedValue;
                        value           uniform (0 0 0);
                    }
                }
            }
            slave { ${..master} }
        }
    }
}

// ************************************************************************* // 
